[
    {
        "ProductId": 1,
        "nome": "Samsung Galaxy S II",
        "descricao": "Samsung Galaxy S II. Um poderoso Smartphone com processador Dual Core de 1.2GHz e Android 2.3, display de altíssimo contraste de 4.27\" Super AMOLED Plus, câmera traseira de 8MP com gravação de vídeo em Full HD 1080p, câmera frontal de 2MP para videochamadas e 16GB de memória interna.São milhares de aplicativos disponíveis no Android Market e você fica sempre conectado com a Internet 3G de alta velocidade HSPA+ 21 e o Wi-Fi Dual Channel. Atualize-se com as redes sociais, veja seus emails pessoais e corporativos e compartilhe informações, sem limites. Quer mais? Ouça suas músicas prediletas MP3 ou rádio FM e curta os jogos 3D, sozinho ou em rede.Samsung Galaxy S II, aproveite ao máximo a liberdade do futuro.",
        "cor": "Preto",
        "modelo": "GT-I9100",
        "codigo": "SAMS-GT-I9100MBLZTO",
        "preco": 1179,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/s2.jpg"
    },
    {
        "ProductId": 2,
        "nome": "Samsung Galaxy S III",
        "descricao": "As funcionalidades deste produto começam na tela inicial, onde você pode ver instantaneamente as novidades das suas redes sociais, personalizar sua tela inicial mudando o fundo, o visual do menu e de outros campos da forma em que achar melhor, além de gerenciar e-mails e ter uma gama de funções que auxiliam em seu dia a dia. Tudo isso com 16GB de memória interna, tela touch, 4,8\" com display Super Amoled HD e sistema android.",
        "cor": "Preto",
        "modelo": "GT-I9300",
        "codigo": "SAMS-GT-I9300MBLZTO",
        "preco": 1449,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/s3.jpg"
    },
    {
        "ProductId": 4,
        "nome": "Samsung Galaxy S IV",
        "descricao": "Equipado com uma câmera traseira de 13 megapixels, o Galaxy S4 possui a função Dual Camera, que permite o uso simultâneo das câmeras frontal e traseira em uma única foto. Sua bateria de alta capacidade de 2600 mAh é um complemento ao desenho super fino, com 7.9mm e apenas 130g, e a tecnologia 4G* que oferece downloads de dados em até 100 Mbps.",
        "cor": "Branco",
        "modelo": "GT-I9500",
        "codigo": "SAMS-GT-I9500MBLZTO",
        "preco": 2299,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/s4.jpg"
    },
    {
        "ProductId": 6,
        "nome": "iPhone 5",
        "descricao": "Com o iPhone 5 você terá muito além do que antes se entendia por diversão, ele oferece um mundo de ação interativa. Muitos jogos em 3D disponíveis na Apple Store, músicas, entre várias outras funcionalidades. Você não vai conseguir esconder o seu entusiasmo. Ele conta com uma Tela Retina Widescreen Multi-Touch de 4 polegadas, câmera de 8 megapíxels com flash LED, e internet 3G de altíssima velocidade. O aparelho vem com um design mais fino e um fone de ouvido, que foi desenvolvido para oferecer melhor qualidade de som e conforto ao usuário.São várias funcionalidades em um só aparelho, dessa forma você aproveita o que há de melhor em tecnologia.",
        "cor": "Preta",
        "modelo": "Apple iPhone 5",
        "codigo": "112445717",
        "preco": 2399,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/iphone5.jpg"
    },
    {
        "ProductId": 7,
        "nome": "HTC One",
        "descricao": "O HTC One é um smartphone top de linha Android com tela de 4,7 polegadas Full HD. O aparelho vem equipado com processador quad-core Snapdragon 600 de 1,7 GHz, 2 GB de RAM e até 64 GB de armazenamento interno, sem suporte a cartão de memória. O HTC One conta ainda com Android 4.1.2 Jelly Bean e câmera traseira de 4 megapixels com tecnologia ultrapixels.",
        "cor": "Branco",
        "modelo": "HTC ONE",
        "codigo": "122445718",
        "preco": 2499,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/htcone.jpg"
    },
    {
        "ProductId": 8,
        "nome": "Samsung Galaxy Note II",
        "descricao": "O Smartphone Samsung Note II vem com um processador de 1,6 GHz com quatro núcleos, o que possibilita a execução de jogos e aplicativos mais complexos. Sua super memória interna de 16GB, pode ser estendida com um cartão Micro SD de até 64GB.",
        "cor": "Branco",
        "modelo": "N7100",
        "codigo": "122445718",
        "preco": 1899,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/galaxynote.jpg"
    },
    {
        "ProductId": 9,
        "nome": "Apple TV",
        "descricao": "A nova Apple TV com HD 1080p dá a você o melhor em entretenimento, diretamente na tela widescreen da sua TV. Escolha entre os milhares de filmes atuais e clássicos disponíveis no iTunes, vários deles em fantástica resolução HD de 1080p. Assista esportes ao vivo em HD. Acesse conteúdo do YouTube, Vimeo e muito mais. Com o AirPlay, você reproduz vídeos, mostra fotos e se diverte com as músicas armazenadas no seu iPhone, iPad ou iPod touch na sua TV.",
        "cor": "Preto",
        "modelo": "Apple TV",
        "codigo": "122445718",
        "preco": 369,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/appletv.jpg"
    },
    {
        "ProductId": 11,
        "nome": "iPad Mini",
        "descricao": "Com memória interna de 16GB, alto desempenho, rapidez, câmeras FaceTime e iSight, bateria com 10 horas de duração e milhares de aplicativos disponíveis para download, o iPad mini vem para proporcionar praticidade e diversão ao seu dia a dia. E tudo isso em versão reduzida, que cabe na palma de sua mão.",
        "cor": "Preto",
        "modelo": "Apple iPad Mini",
        "codigo": "122445718",
        "preco": 1649,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/ipadmini.jpg"
    },
    {
        "ProductId": 12,
        "nome": "Samsung Galaxy Tab 2",
        "descricao": "O Tablet Samsung Galaxy Tab 2 vem com o sistema operacional Android 4.0, um processador 1 GHZ Dual Core deixando-o com mais velocidade.Você terá acesso aos seus conteúdos favoritos com um simples toque na tela capacitiva de 7 polegadas, assim você tem uma ótima visualização das redes sociais, e-mails e seus aplicativos que são milhares disponíveis para download.",
        "cor": "Preto",
        "modelo": "P3110",
        "codigo": "122445718",
        "preco": 699,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/galaxytab2.jpg"
    },
    {
        "ProductId": 13,
        "nome": "Playstation 4",
        "descricao": "O Playstation ou PS4 sera o novo vídeo game da sony, ele terá 8GB de Ram, leitor de blu-rey e um sensor de movimentos embutido no controle, o DualShock 4.Ainda sobre o Josytck, ele tambem contara com sensor touchscreen e um botão para compartilhar conteúdo em tempo real.",
        "cor": "Preto",
        "modelo": "Sony P4",
        "codigo": "122445718",
        "preco": 2999,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/ps4.jpg"
    },
    {
        "ProductId": 14,
        "nome": "Xbox One",
        "descricao": "Xbox One é o novo console da Microsoft. Ele possui um sistema de reconhecimento facial, gestual e de voz. O novo Xbox integrará os diversos serviços da empresa em um só aparelho, como TV, Internet, música, Skype e, claro, games. É possível utilizar mais de um serviço simultaneamente com o sistema Snap Mode, visualizando diferentes aplicativos na mesma tela. Especificações supostamente vazadas afirmam que ele terá cerca de 8 GB de Ram, processador de 4 núcleos, Kinect 2.0 e leitor de Blu-Ray.",
        "cor": "Preto",
        "modelo": "Microsoft Xbox one",
        "codigo": "122445718",
        "preco": 3099,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/xboxone.jpg"
    },
    {
        "ProductId": 15,
        "nome": "Playstation Vita",
        "descricao": "Playstation Vita é um console portátil da Sony. Sucessor do PSP, o PS Vita foi lançado para mudar a forma como os gamers veem os consoles móveis, pois conta com gráficos de primeira qualidade, todas as funcionalidades dos controles e muito mais, como o caso da mistura de botões com touchscreen.",
        "cor": "Preto",
        "modelo": "Microsoft Xbox one",
        "codigo": "122445718",
        "preco": 1399,
        "peso": 1,
        "altura": 5,
        "largura": 20,
        "comprimento": 25,
        "diametro": 22,
        "urlImagem": "http://www.soaportal.tk/images/psvita.jpg"
    }
]